package com.example.pizzarecipes;

public class Utils {
    public static final String PIZZA_1_TITLE = "Пицца с домашним соусом";
    public static final String PIZZA_1_DESCRIPTION = "Приготовьте пиццу для всей семьи с домашней основой и томатным соусом. Вегетарианский рецепт идеально подходит для того, чтобы приобщить к приготовлению детей. Сверху посыпьте моцареллой и свежим базиликом";
    public static final String PIZZA_1_RECIPE = "ШАГ 1\n" +
            "Высыпьте муку в миску, затем добавьте дрожжи и 1 ч. л. соли. Сделайте углубление в центре и влейте 200 мл теплой воды (убедитесь, что она не слишком горячая) вместе с маслом. Перемешивайте деревянной ложкой, пока не получится мягкое, достаточно влажное тесто.\n" +
            "\n" +
            "ШАГ 2\n" +
            "Выложите тесто на слегка посыпанную мукой поверхность и месите в течение 5 минут до получения однородной массы. Накройте кухонным полотенцем и отставьте примерно на час или пока тесто не вздуется и не увеличится в размере вдвое. Вы также можете оставить грубое тесто без замешивания в миске, накрыть кухонным полотенцем и оставить в холодильнике на ночь, тогда тесто будет готовиться само по себе.\n" +
            "\n" +
            "ШАГ 3\n" +
            "Тем временем приготовьте томатный соус. Налейте масло в небольшую сковороду и слегка обжарьте чеснок (не дайте ему подрумяниться), затем добавьте пассату и тушите все, пока соус немного не загустеет. Оставьте остывать.\n" +
            "\n" +
            "ШАГ 4\n" +
            "Как только тесто поднимется, быстро замесите его в миске, чтобы отбить, затем выложите на слегка посыпанную мукой поверхность и разделайте на два шарика. Раскатайте каждый шарик в большую каплю, очень тонкую, около 25 см в поперечнике (каплевидные формы легче подходят для выпечки, чем круглые).\n" +
            "\n" +
            "ШАГ 5\n" +
            "Разогрейте духовку до 240 ° C / вентилятор 220 ° C / газ 9 с большим противнем внутри. Переложите одну из основ на другой противень, посыпанный мукой. Разровняйте соус по основе тыльной стороной ложки, распределите по половинке моцареллы, сбрызните оливковым маслом и приправьте. Положите пиццу, все еще лежащую на противне, поверх горячего листа в духовке и запекайте в течение 8-10 минут до образования хрустящей корочки.";

}
